#+title: Emacs Configuration
#+property: header-args:emacs-lisp :tangle ./init-new.el :mkdirp yes

* Basic UI configuration
#+begin_src emacs-lisp
;; Don't show the splash screen
(setq inhibit-startup-message t)
#+end_src

#+name: the-value
#+begin_src emacs-lisp
(+ 1 1)
#+end_src

#+RESULTS: the-value
: 2

#+begin_src conf .config/some-app/config :noweb yes
  value=<<the-value()>>
  a=n
  alsda=adkmas
  asld,a=a,mca

#+end_src

* Org Mode

* Applications
